EDTДоговоры_ПРОФ_демо/src/InformationRegisters/Нумерация/Нумерация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Нумерация</name>
  <resources>
    <name>ТекущийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.ДоговорныеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНумерации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTДоговоры_ПРОФ_демо/src/Enums/ТипыДоговорныхДокументов/ТипыДоговорныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговорныхДокументов</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДопСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Акт</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>Счет</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/InformationRegisters/Нумерация/Forms/ФормаСпискаДляВидаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидДокумента", Параметры.ВидДокумента);
	Если Параметры.ВидДокумента.Тип = Перечисления.ТипыДоговорныхДокументов.Договор Тогда 
		Элементы.СвязанныйДокумент.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры
